class Surah {
  final int number;
  final String name;
  final String details;
  final String arabic;
  final String? tafsir;
  final String? ayat1;

  Surah({
    required this.number,
    required this.name,
    required this.details,
    required this.arabic,
    this.ayat1,
    this.tafsir,
  });
}

List<Surah> surahList = [
  Surah(
    number: 1,
    name: 'Al-Fatihah',
    details: '7 Verses | Meccan',
    arabic: 'الفاتحة',
    ayat1: 'اَلۡحَمۡدُ لِلّٰہِ رَبِّ الۡعٰلَمِیۡنَ ۙ',
    tafsir:
        'আপনি যদি কোনও ইমারতের প্রশংসা করেন, তবে প্রকৃতপক্ষে সে প্রশংসা হয় ইমারতটির নির্মাতার। সুতরাং এই সৃষ্টিজগতের যে-কোনও বস্তুর প্রশংসা করা হলে পরিণামে সে প্রশংসা হয় আল্লাহ তাআলার, যেহেতু সে বস্তু তাঁরই সৃষ্টি। জগতসমূহের প্রতিপালক বলে সে দিকেই ইশারা করা হয়েছে। মানব জগত, জড় জগত ও উদ্ভিদ জগত থেকে শুরু করে নভোমণ্ডল, নক্ষত্রমণ্ডল ও ফিরিশতা জগত পর্যন্ত সব কিছুর সৃজন ও প্রতিপালন আল্লাহ তাআলারই কাজ। এসব জগতের মধ্যে যা কিছু প্রশংসাযোগ্য আছে, আল্লাহ তাআলার সৃজন ও রবূবিয়্যাতের মহিমার কারণেই তা প্রশংসার যোগ্যতা লাভ করেছে।',
  ),
  Surah(
    number: 2,
    name: 'Al-Baqarah',
    details: '286 Verses | Medinan',
    arabic: 'البقرة',
    ayat1: 'الٓـمّٓ ۚ',
    tafsir:
        'বিভিন্ন সূরার শুরুতে এ রকমের হরফ এভাবেই পৃথক-পৃথকরূপে নাযিল হয়েছিল। এগুলোকে আল-হুরূফুল মুকাত্তাআত (বিচ্ছিন্ন হরফসমূহ) বলে। এগুলোর অর্থ ও মর্ম সম্পর্কে সঠিক কথা এই যে, তা আল্লাহ তাআলা ছাড়া কারও জানা নেই। এটা আল্লাহ তাআলার কিতাবের এক নিগূঢ় রহস্য। এ নিয়ে গবেষণা ও অনুসন্ধানের কোনও প্রয়োজন নেই। কেননা এর অর্থ বোঝার উপর আকীদা ও আমলের কোনও মাসআলা নির্ভরশীল নয়।',
  ),
  Surah(
    number: 3,
    name: 'Al-Imran',
    details: '200 Verses | Medinan',
    arabic: 'آل عمران',
  ),
  Surah(
    number: 4,
    name: 'An-Nisa',
    details: '176 Verses | Medinan',
    arabic: 'النساء',
    ayat1:
        'یٰۤاَیُّہَا النَّاسُ اتَّقُوۡا رَبَّکُمُ الَّذِیۡ خَلَقَکُمۡ \nمِّنۡ نَّفۡسٍ وَّاحِدَۃٍ وَّخَلَقَ مِنۡہَا زَوۡجَہَا وَبَثَّ مِنۡہُمَا \nرِجَالًا کَثِیۡرًا وَّنِسَآءً ۚ وَاتَّقُوا اللّٰہَ الَّذِیۡ تَسَآءَلُوۡنَ\n بِہٖ وَالۡاَرۡحَامَ ؕ اِنَّ اللّٰہَ کَانَ عَلَیۡکُمۡ رَقِیۡبًا',
    tafsir:
        '১. এ আয়াতে পর্যায়ক্রমে মৌলিক তিনটি বিষয়ের প্রতি দৃষ্টি আকর্ষণ করা হয়েছে : (ক) সৃষ্টিকর্তা হওয়ার কারণে এক আল্লাহকে ভয় করা ও কেবল তাঁরই ইবাদত-আনুগত্য করা; (খ) একই আদম-সন্তান হওয়ার কারণে সমস্ত মানুষের অধিকার সম্পর্কে সচেতন থাকা। কোনও অবস্থায়ই কারও কোন অধিকার হরণ না করা এবং (গ) অন্যান্য মানুষ অপেক্ষা আত্মীয়-স্বজনের সাথে ঘনিষ্ঠতা বেশি থাকায় তাদের অধিকারও যেহেতু অন্যদের তুলনায় বেশি, তাই তাদের অধিকারসমূহ আদায়ে অধিকতর যত্নবান থাকা। মৌলিকভাবে এ সূরায় এ তিনও বিষয় সম্পর্কিত বিস্তারিত বিধানাবলী বর্ণিত হয়েছে। যার অনুসরণের মধ্যে রয়েছে পারিবারিক, সামাজিক তথা বৈশ্বিক শান্তি ও নিরাপত্তার নিশ্চয়তা। -অনুবাদক'
        '২. দুনিয়ায় মানুষ যখন একে অন্যের কাছে নিজের প্রাপ্য অধিকার দাবী করে, তখন অধিকাংশ সময়ই বলে থাকে, ‘আল্লাহর ওয়াস্তে তুমি আমাকে আমার পাওনা মিটিয়ে দাও।’ আল্লাহ তাআলা এ আয়াতে বলছেন যে, তোমরা যখন নিজেদের হক ও প্রাপ্য অধিকারসমূহের ক্ষেত্রে আল্লাহ তাআলাকে অছিলা বানাও, তখন অন্যদের হক আদায়ের ব্যাপারেও আল্লাহ তাআলাকে ভয় কর এবং মানুষের সর্বপ্রকার হক পরিপূর্ণভাবে আদায় করে দাও।',
  ),
  Surah(
    number: 5,
    name: 'Al-Ma\'idah',
    details: '120 Verses | Medinan',
    arabic: 'المائدة',
    ayat1:
        'یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اَوۡفُوۡا بِالۡعُقُوۡدِ ۬ؕ \nاُحِلَّتۡ لَکُمۡ بَہِیۡمَۃُ الۡاَنۡعَامِ اِلَّا مَn یُتۡلٰی عَلَیۡکُمۡ غَیۡرَ\n مُحِلِّی الصَّیۡدِ وَاَنۡتُمۡ حُرُمٌ ؕ اِنَّ\n اللّٰہَ یَحۡکُمُ مَا یُرِیۡدُ',
    tafsir:
        "১. ‘বাহীমা’ বলতে যে-কোনও চার পা বিশিষ্ট প্রাণীকে বোঝায়, কিন্তু তার মধ্যে হালাল কেবল গৃহপালিত (বা গবাদি) পশু, অর্থাৎ গরু, উট, ছাগল, ভেড়া অথবা যে-গুলো গবাদি পশুর সাথে সাদৃশ্যপূর্ণ, যেমন হরিণ, নীল গাই ইত্যাদি।"
        '২. সামনে ৩নং আয়াতে যে হারাম জিনিসসমূহের তালিকা দেওয়া হয়েছে, এটা তার প্রতি ইঙ্গিত।'
        '৩. অর্থাৎ গবাদি পশু-সদৃশ জন্তু যদিও হালাল, কিন্তু কেউ হজ্জ বা উমরার ইহরাম বেঁধে ফেললে তার পক্ষে এসব পশু শিকার করা হারাম হয়ে যায়।'
        '৪. মানুষ কেবল নিজ সীমিত বুদ্ধির উপর নির্ভর করে শরয়ী বিধানাবলী সম্পর্কে যেসব প্রশ্ন তোলে এ বাক্যটি তার মূলোৎপাটন করেছে, যেমন এই প্রশ্ন যে, জীব-জন্তুর যখন প্রাণ আছে, তখন তাদেরকে যবাহ করে খাওয়া বৈধ করা হল কেন, বিশেষত যখন এর দ্বারা এক প্রাণীকে কষ্ট দেওয়া হয়? কিংবা এই প্রশ্ন যে, কেন অমুক প্রাণীকে হালাল করা হল এবং অমুক প্রাণীকে হারাম? আয়াতের এ বাক্যটিতে অতি সংক্ষেপে, অথচ পূর্ণাঙ্গ ও বস্তুনিষ্ঠভাবে তার উত্তর দেওয়া হয়েছে। বলা হয়েছে, আল্লাহ তা‘আলা বিশ্ব-জগতের স্রষ্টা ও প্রতিপালক। তিনি নিজ হিকমত ও প্রজ্ঞার ভিত্তিতে যে জিনিসের ইচ্ছা করেন হুকুম দিয়ে দেন। সন্দেহ নেই যে, তার প্রতিটি হুকুমেই কোনও না কোনও হিকমত ও তাৎপর্য নিহিত থাকে, কিন্তু প্রতিটি হুকুমের হিকমত ও তাৎপর্য যে মানুষের বোধগম্য হতেই হবে এটা অনিবার্য নয়। সুতরাং মানুষের কাজ কেবল বিনা বাক্যে তার প্রতিটি হুকুম পালন করে যাওয়া।',
  ),
  Surah(
    number: 8,
    name: 'Al-Anfal',
    details: '75 Verses | Medinan',
    arabic: 'الأنفال',
    ayat1:
        'یَسۡـَٔلُوۡنَکَ عَنِ الۡاَنۡفَالِ ؕ قُلِ الۡاَنۡفَالُ لِلّٰہِ وَالرَّسُوۡلِ ۚ فَاتَّقُوا \nاللّٰہَ وَاَصۡلِحُوۡا ذَاتَ بَیۡنِکُمۡ ۪ وَاَطِیۡعُوا اللّٰہَ وَرَسُوۡلَہٗۤ اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ',
    tafsir:
        '১. বদর যুদ্ধে যখন শত্রুদের পরাজয় ঘটল, তখন সাহাবায়ে কিরাম তিন ভাগে বিভক্ত হয়ে পড়েছিলেন। একদল নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের হিফাজতের দায়িত্বে নিয়োজিত থাকলেন। একদল শত্রুর পশ্চাদ্ধাবন করার জন্য রওয়ানা হয়ে গেলেন এবং একদল শত্রুর ফেলে যাওয়া মালামাল কুড়াতে শুরু করলেন। যেহেতু এটাই ছিল প্রথম যুদ্ধ এবং যুদ্ধলব্ধ সম্পদ সম্পর্কে বিস্তারিত বিধান তখনও পর্যন্ত নাযিল হয়নি, তাই তৃতীয় দল মনে করেছিল, তারা যে মালামাল কুড়িয়েছে, তা তাদেরই। (সম্ভবত জাহিলী যুগে এমনই রেওয়াজ ছিল)। কিন্তু যুদ্ধ শেষ হওয়ার পর প্রথমোক্ত দুই দলের খেয়াল হল, তারাও তো যুদ্ধে পুরোপুরি শরীক ছিল, বরং গনীমত কুড়ানোর সময় তারাই বেশি গুরুত্বপূর্ণ কাজ আঞ্জাম দিয়েছে। সুতরাং গনীমতের ভেতর তাদেরও অংশ থাকা চাই। বস্তুত এটা ছিল এক স্বভাবগত চাহিদা, যে কারণে এ নিয়ে তাদের মধ্যে কিছুটা বাদানুবাদও শুরু হয়ে গিয়েছিল। যখন বিষয়টা নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের কাছে পৌঁছল, তখন এই আয়াত নাযিল হল। এতে জানানো হয়েছে, গনীমত বা যুদ্ধলব্ধ সম্পদ সম্পর্কে ফায়সালা নেওয়ার এখতিয়ার কেবল আল্লাহ ও তাঁর রাসূলের। সুতরাং সামনে এ সূরারই ৪১নং আয়াতে গনীমত বণ্টনের বিস্তারিত নীতিমালা বর্ণিত হয়েছে। আর এ আয়াতে আদেশ করা হয়েছে যে, মুসলিমদের মধ্যে যদি কোনও বিষয়ে মনোমালিন্য দেখা দেয়, তবে তা দূর করে পারস্পরিক সম্পর্ক ঠিক করে নেওয়া চাই।',
  ),
  Surah(
    number: 49,
    name: 'Al-Hujarat',
    details: '18 Verses | Medinan',
    arabic: 'الحجرات',
    ayat1:
        'یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تُقَدِّمُوۡا بَیۡنَ یَدَیِ اللّٰہِ وَرَسُوۡلِہٖ وَاتَّقُوا اللّٰہَ ؕ اِنَّ اللّٰہَ سَمِیۡعٌ عَلِیۡمٌ',
    tafsir:
        'সূরার প্রথম পাঁচটি আয়াত এক বিশেষ ঘটনাকে কেন্দ্র করে নাযিল হয়েছে। মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কাছে আরবের বিভিন্ন গোত্র থেকে প্রতিনিধি দল আসত। তিনি প্রতিটি প্রতিনিধি দলের একজনকে ভবিষ্যতের জন্য তাদের গোত্রের আমীর বানিয়ে দিতেন। একবার তাঁর কাছে তামীম গোত্রের একটি প্রতিনিধি দল আসল। তাদের মধ্যে কাকে গোত্রের আমীর বানানো হবে সে সম্পর্কে কোন কথা শুরু না হতেই বা মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে সম্বন্ধে পরামর্শ চাওয়ার আগেই হযরত আবু বকর সিদ্দীক ও হযরত উমর (রাযি.) নিজেদের পক্ষ হতে প্রস্তাবনা শুরু করে দিলেন। হযরত আবু বকর (রাযি.) এক ব্যক্তির নাম নিয়ে বললেন, তাকে আমীর বানানো হবে আর হযরত উমর (রাযি.) অন্য এক ব্যক্তির পক্ষে রায় দিলেন। তারপর উভয়ে আপন-আপন প্রস্তাবের সপক্ষে এভাবে যুক্তি-তর্ক শুরু করে দিলেন যে, তা কিছুটা বাক-বিতণ্ডার রূপ নিয়ে নিল এবং তাতে উভয়ের আওয়াজও চড়া হয়ে গেল। এ পরিপ্রেক্ষিতে প্রথম তিন আয়াত নাযিল হয়। প্রথম আয়াতে নির্দেশনা দেওয়া হয়েছে যে, যেসব বিষয়ে মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজেই কোন সিদ্ধান্ত নেবেন, সেসব বিষয়ে তিনি যতক্ষণ পর্যন্ত পরামর্শ না চান, ততক্ষণ পর্যন্ত নীরবতা অবলম্বন জরুরী। যদি নিজেরা আগে বেড়ে কোন রায় স্থির করে নেওয়া হয় এবং তার পক্ষে যুক্তি-তর্কের অবতারণা বা তা মানানোর জন্য পীড়াপীড়ি করা হয়, তবে তা মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সঙ্গে আদবের খেলাফ কাজ হবে। যদিও প্রথম আয়াতটি এই বিশেষ ঘটনাকে কেন্দ্র করে নাযিল হয়েছে, কিন্তু এতে শব্দ ব্যবহার করা হয়েছে সাধারণ, যাতে এটা সকলের জন্য একটা মূলনীতি হয়ে যায়। মূলনীতিটির সারকথা হল, কোনও বিষয়েই মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আগে বেড়ে যাওয়া কোন মুসলিমের জন্য জায়েয নয়। এমনকি তার সঙ্গে যখন একত্রে চলাফেরা করা হবে, তখনও তার সামনে সামনে হাঁটা যাবে না। তাছাড়া জীবনের বিভিন্ন ক্ষেত্রে তিনি যে সীমারেখা স্থির করে দিয়েছেন তা অতিক্রম করার চেষ্টাও তার সঙ্গে বেয়াদবীর শামিল। কাজেই তা থেকেও বিরত থাকতে হবে। অতঃপর দ্বিতীয় ও তৃতীয় আয়াতে নির্দেশনা দেওয়া হয়েছে যে, মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের মজলিসে বসা থাকাকালে নিজ কণ্ঠস্বরকে তাঁর কণ্ঠস্বর অপেক্ষা উঁচু করা উচিত নয় এবং তাঁর সঙ্গে কোন কথা বলতে হলে তাও উঁচু আওয়াজে বলা ঠিক নয়; বরং তাঁর মজলিসে নিজ কণ্ঠস্বর নিচু রাখার চেষ্টা করতে হবে।',
  ),
];
